# StructuralSectionGeneralF Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralF Class
Members See Also
---
Defines parameters for Flat Bar.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralF : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralF _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionGeneralF : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralF Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangleParameterized Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangularBar
# See Also
StructuralSectionGeneralF Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace